
// ****************************************************************************
//                                 
//                         FileSel - File selection
//
// ****************************************************************************
// PicoLibSDK - Alternative SDK library for Raspberry Pico and RP2040
// Copyright (c) 2023 Miroslav Nemecek, Panda38@seznam.cz, hardyplotter2@gmail.com
// 	https://github.com/Panda381/PicoLibSDK
//	https://www.breatharian.eu/hw/picolibsdk/index_en.html
//	https://github.com/pajenicko/picopad
//	https://picopad.eu/en/
// License:
//	This source code is freely available for any purpose, including commercial.
//	It is possible to take and modify the code or parts of it, without restriction.

#include "../../global.h"	// globals

#if USE_FILESEL		// use file selection (lib_filesel.c, lib_filesel.h)

#include "../../_display/_include.h"	// display interface (colors)
#include "../../_devices/key.h"		// key interface

#include "../../_sdk/inc/sdk_timer.h"
#include "../../_sdk/usb_inc/sdk_usb_host_hid.h"

#include "../inc/lib_decnum.h"
#include "../inc/lib_draw.h"
#include "../inc/lib_filesel.h"

// text of file panel
#define FILESEL_FONTW	8	// file panel font width
#define FILESEL_FONTH	16	// file panel font height
#define FILESEL_TEXTW	(WIDTH/FILESEL_FONTW) // number of characters per row (=320/8=40)
#define FILESEL_TEXTH	(HEIGHT/FILESEL_FONTH) // number of rows (=240/16=15)

// text of preview
#define FILESEL_FONTW2	6	// preview font width
#define FILESEL_FONTH2	8	// preview font height
#define FILESEL_TEXTW2	(WIDTH/FILESEL_FONTW2) // number of characters per row (=320/6=53)
#define FILESEL_TEXTH2	(HEIGHT/FILESEL_FONTH2) // number of rows (=240/8=30)

// files
#define FILESEL_MAXFILES	256	// max files in one directory
#define FILESEL_NAMELEN		9	// max. length of filename without extension and with terminating 0
#define FILESEL_FILEROWS	(FILESEL_TEXTH-2) // rows of files (=13)
#define FILESEL_FILECOLW	20	// width of file panel

// file entry descriptor (10 bytes)
//#define ATTR_RO	B0	// Read only
//#define ATTR_HID	B1	// Hidden
//#define ATTR_SYS	B2	// System
//#define ATTR_VOL	B3	// Volume label
//#define ATTR_DIR	B4	// Directory
//#define ATTR_ARCH	B5	// Archive
#define ATTR_TXT	B6	// internal: text file TXT present
#define ATTR_BMP	B7	// internal: bitmap indicator BMP present
#define ATTR_MASK	0x3F	// mask of valid bits

typedef struct {
	u32	size;		// file size
	u8	attr;		// attributes ATTR_*
	u8	len;		// file name length
	u8	ext;		// index of file extension 0..2
	char	name[8+1];	// file name (without extension, with terminating zero)
} sFileDesc;

/*
// BMP file header (size 70 bytes)
#pragma pack(push,1)
typedef struct {
	// BMP file header (size 14 bytes)
	u16	bfType;			// 0x00: magic, 'B' 'M' = 0x4D42
	u32	bfSize;			// 0x02: file size, aligned to DWORD = 70 + 320*240*2 + 2 = 153672 = 0x25848
	u16	bfReserved1;		// 0x06: = 0
	u16	bfReserved2;		// 0x08: = 0
	u32	bfOffBits;		// 0x0A: offset of data bits after file header = 70 (0x46)
	// BMP info header (size 40 bytes)
	u32	biSize;			// 0x0E: size of this info header = 56 (0x38)
	s32	biWidth;		// 0x12: width = 320 (0x140)
	s32	biHeight;		// 0x16: height, negate if flip row order = -240 (0xFFFFFF10)
	u16	biPlanes;		// 0x1A: planes = 1
	u16	biBitCount;		// 0x1C: number of bits per pixel = 16
	u32	biCompression;		// 0x1E: compression = 3 (BI_BITFIELDS)
	u32	biSizeImage;		// 0x22: size of data of image + aligned file = 320*240*2 + 2 = 153602 (0x25802)
	s32	biXPelsPerMeter;	// 0x26: X pels per meter = 2834 (= 0xB12)
	s32	biYPelsPerMeter;	// 0x2A: Y pels per meter = 2834 (= 0xB12)
	u32	biClrUsed;		// 0x2E: number of user colors (0 = all)
	u32	biClrImportant;		// 0x32: number of important colors (0 = all)
	// BMP color bit mask (size 16 bytes)
	u32	biRedMask;		// 0x36: red mask = 0x0000F800
	u32	biGreenMask;		// 0x3A: green mask = 0x000007E0
	u32	biBlueMask;		// 0x3E: blue mask = 0x0000001F
	u32	biAlphaMask;		// 0x42: alpha mask = 0x00000000
					// 0x46
} sBmp;
#pragma pack(pop)
*/

// current path
char FileSelPath[FILESEL_PATHMAX+1]; // current path (with terminating 0, without last path character if not root)
int FileSelPathLen; // length of path
int FileSelRootLen; // length of root

// title (used instead of root path)
char FileSelTitle[FILESEL_FILECOLW+1]; // title (with terminating 0)
int FileSelTitleLen; // length of title

// file extension
char FileSelExt[4]; // file extension in uppercase (1 to 3 characters, with terminating 0)
int FileSelExtLen; // length of file extension (1 to 3 characters)

char FileSelExt2[4]; // file extension 2 in uppercase (0 to 3 characters, with terminating 0)
int FileSelExtLen2; // length of file extension 2 (0 to 3 characters)

char FileSelExt3[4]; // file extension 3 in uppercase (0 to 3 characters, with terminating 0)
int FileSelExtLen3; // length of file extension 3 (0 to 3 characters)

// colors template - blue theme
