
// ****************************************************************************
//
//                              USB Definitions
//
// ****************************************************************************
// PicoLibSDK - Alternative SDK library for Raspberry Pico and RP2040
// Copyright (c) 2023 Miroslav Nemecek, Panda38@seznam.cz, hardyplotter2@gmail.com
// 	https://github.com/Panda381/PicoLibSDK
//	https://www.breatharian.eu/hw/picolibsdk/index_en.html
//	https://github.com/pajenicko/picopad
//	https://picopad.eu/en/
// License:
//	This source code is freely available for any purpose, including commercial.
//	It is possible to take and modify the code or parts of it, without restriction.

// This code is based on TinyUSB library, Copyright (c) 2019 Ha Thach (tinyusb.org)

#if USE_USB		// use USB (sdk_usb_*.c, sdk_usb_*.h)

#ifndef _SDK_USB_DEF_H
#define _SDK_USB_DEF_H

#include "../sdk_addressmap.h"		// Register address offsets

#ifdef __cplusplus
extern "C" {
#endif

// ----------------------------------------------------------------------------
//                           Constants and macros
// ----------------------------------------------------------------------------

#define USB_ENDPOINT_NUM	16		// total number of endpoints (0..15)
#define USB_ENDPOINT_NUM2	(USB_ENDPOINT_NUM*2) // total number of endpoints including direction (0..31)
#define USB_SETUP_PKT_SIZE	8		// size of setup packet
#define USB_PACKET_MAX		64		// max. size of normal packet

//  bit 0: enable second DP pull-up resistor (0=Pu2, 1=Pu1+Pu2)
//  bit 1: DP pull-up enable
//  bit 2: DP pull-down enable
//  bit 4: enable second DM pull-up resistor (0=Pu2, 1=Pu1+Pu2)
//  bit 5: DM pull-up enable
//  bit 6: DM pull-down enable
//  bit 8: DP output enable
//  bit 9: DM output enable
//  bit 10: DP output
//  bit 11: DM output
//  bit 12: RX power down override (1=powered down)
//  bit 13: TX power down override (1=powered down)
//  bit 14: TX 0=low speed slew rate, 1=full speed slew rate
//  bit 15: TX 0=single ended mode, 1=differential drive mode
//  bit 16: read differential RX
//  bit 17: read DPP pin state
//  bit 18: read DPM pin state
//  bit 19: read DP over current
//  bit 20: read DM over current
//  bit 21: read DP over voltage
//  bit 22: read DM over voltage
#define USB_PHY_OVERRIDE	((volatile u32*)(USBCTRL_REGS_BASE + 0x80))	// override enable of USB phy direct
//  bit 0: DP pullup hisel override enable
//  bit 1: DM pullup hisel override enable
//  bit 2: DP pullup enable override enable
//  bit 3: DP pulldown enable override enable
//  bit 4: DM pulldown enable override enable
//  bit 5: TX DP output enable override enable
//  bit 6: TX DM output enable override enable
//  bit 7: TX DP override enable
//  bit 8: TX DM override enable
//  bit 9: RX PD override enable
//  bit 10: TX PD override enable
//  bit 11: TX slew override enable
//  bit 12: DM pullup override enable
//  bit 15: TX diff mode override enable
#define USB_PHY_TRIM		((volatile u32*)(USBCTRL_REGS_BASE + 0x84))	// adjust trim of USB phy pull down resistors
//  bit 0..4: adjust DP pulldown resistor
//  bit 8..12: adjust DM pulldown resistor
#define USB_INTR		((volatile u32*)(USBCTRL_REGS_BASE + 0x8C))	// raw interrupts
#define USB_INTE		((volatile u32*)(USBCTRL_REGS_BASE + 0x90))	// interrupt enable
#define USB_INTF		((volatile u32*)(USBCTRL_REGS_BASE + 0x94))	// interrupt force
#define USB_INTS		((volatile u32*)(USBCTRL_REGS_BASE + 0x98))	// interrupt status
//  bit 0: host: device is connected or disconnected (cleared by writing status speed)
//  bit 1: host: device wakes up the host (cleared by writing status resume)
//  bit 2: host: host sends SOF (cleared by reading SOF)
//  bit 3: transfer completed (write to clear)
//  bit 4: any bit of buffer status is set (clear by clearing all buffer status bits)
//  bit 5: SEQ error
//  bit 6: RX timeout
//  bit 7: RX overflow
//  bit 8: bit stuff error
//  bit 9: CRC error
//  bit 10: STALL received
//  bit 11: VBUS detect
//  bit 12: BUS reset
//  bit 13: device connection state changes (cleared by writing to status connected)
//  bit 14: device suspend state changes (cleared by writing to status suspended)
//  bit 15: device receives resume from host (cleared by writing to status resume)
//  bit 16: device: setup request
//  bit 17: device: device receives SOF (cleared by reading SOF)
//  bit 18: any bit of abort done is set (cleared by clearing all bits in abort done)
//  bit 19: any bit of stall NAK is set (cleared by clearing all bits in stall NAK)

typedef struct {
	io32	dev_addr_ctrl;		// 0x00: Device address and endpoint control
	io32	int_ep_addr_ctrl[15];	// 0x04: Interrupt endpoint
	io32	main_ctrl;		// 0x40: Main control register
	io32	sof_wr;			// 0x44: Set the SOF (Start of Frame) frame number in the host controller
	io32	sof_rd;			// 0x48: Read the last SOF (Start of Frame) frame number seen
	io32	sie_ctrl;		// 0x4C: SIE control register
	io32	sie_status;		// 0x50: SIE status register
	io32	int_ep_ctrl;		// 0x54: interrupt endpoint control register
	io32	buf_status;		// 0x58: Buffer status register
	io32	buf_cpu_should_handle;	// 0x5C: Which of the double buffers should be handled
	io32	abort;			// 0x60: Device only: Can be set to ignore the buffer control register for this endpoint in case you...
	io32	abort_done;		// 0x64: Device only: Used in conjunction with `EP_ABORT`
	io32	ep_stall_arm;		// 0x68: Device: this bit must be set in conjunction with the `STALL` bit in the buffer control register...
	io32	nak_poll;		// 0x6C: Used by the host controller
	io32	ep_nak_stall_status;	// 0x70: Device: bits are set when the `IRQ_ON_NAK` or `IRQ_ON_STALL` bits are set
	io32	muxing;			// 0x74: Where to connect the USB controller
	io32	pwr;			// 0x78: Overrides for the power signals in the event that the VBUS signals are not hooked up to GPIO
	io32	phy_direct;		// 0x7C: Note that most functions are driven directly from usb_fsls controller
	io32	phy_direct_override;	// 0x80: override
	io32	phy_trim;		// 0x84: Value to drive to USB PHY
	io32	_pad0;			// 0x88:
	io32	intr;			// 0x8C: Raw Interrupts
	io32	inte;			// 0x90: Interrupt Enable
	io32	intf;			// 0x94: Interrupt Force
	io32	ints;			// 0x98: Interrupt status after masking & forcing
} usb_hw_t;

#define usb_hw ((usb_hw_t*)USBCTRL_REGS_BASE)

STATIC_ASSERT(sizeof(usb_hw_t) == 0x9C, "Incorrect usb_hw_t!");

// ----------------------------------------------------------------------------
//                             USB endpoint descriptor
// ----------------------------------------------------------------------------

// USB endpoint descriptor
//  Device: The index into the UsbEndpoints array is also an index into the control registers
//          and can be used to derive the endpoint number (bits 1..4) and direction (bit 0).
//  Host: Host uses only endpoint descriptors with index 0..15. Endpoints 1..15 correspond to
//        interrupt number 1..15, endpoint 0 corresponds to control endpoint EPX.

typedef struct {
	Bool		used;		// this endpoint is used ("configured")
	volatile Bool	active;		// transfer is active (busy; i.e. endpoint is used to transfer) ... flag is controlled by PHY code
