
// ****************************************************************************
//
//                                     UART
//                  Universal Asynchronous Receiver-Transmitter
//
// ****************************************************************************
// PicoLibSDK - Alternative SDK library for Raspberry Pico and RP2040
// Copyright (c) 2023 Miroslav Nemecek, Panda38@seznam.cz, hardyplotter2@gmail.com
// 	https://github.com/Panda381/PicoLibSDK
//	https://www.breatharian.eu/hw/picolibsdk/index_en.html
//	https://github.com/pajenicko/picopad
//	https://picopad.eu/en/
// License:
//	This source code is freely available for any purpose, including commercial.
//	It is possible to take and modify the code or parts of it, without restriction.

// UART controller is based on ARM Primecell UART PL011 revision r1p5
//  ... IrDA and modem mode of PL011 on RP2040 is not supported

// UART signals (active in LOW; inputs should be pull-ups):
//   TX ... -> (output) transmitted data -> connect to RX
//   RX ... <- (input) received data -> connect to TX
//   CTS ... <- (input) input flow control (= can send data) -> connect to RTS
//   RTS ... -> (output) output flow control (= can receive data) -> connect to CTS

// After init, connect UART to GPIO pins using GPIO_Fnc(pin, GPIO_FNC_UART).
// After connecting the GPIO, wait a moment with WaitUs(50) and
// then flush any fake received characters with UART_RecvFlush.

//   GPIO0  ... UART0 TX
//   GPIO1  ... UART0 RX

//   GPIO21 ... UART1 RX
//   GPIO22 ... UART1 CTS
//  (GPIO23 ... UART1 RTS)

//  (GPIO24 ... UART1 TX)
//  (GPIO25 ... UART1 RX)
//   GPIO26 ... UART1 CTS
//   GPIO27 ... UART1 RTS

//   GPIO28 ... UART0 TX
//  (GPIO29 ... UART0 RX)

// using external compilation switch and parameters (from config_def.h):
//#define UARTSAMPLE	1	// flag in sdk_uart.*, compile UART test sample: 1 = compile, 0 = not

#if USE_UART	// use UART serial port (sdk_uart.c, sdk_uart.h)

#ifndef _SDK_UART_H
#define _SDK_UART_H

//#include "resource.h"		// Resources
#include "../sdk_addressmap.h"		// Register address offsets
#include "sdk_reset.h"
#include "../../_lib/inc/lib_ring.h"		// ring buffer
#include "../../_lib/inc/lib_stream.h"		// ring buffer
#include "../sdk_dreq.h"

#if USE_ORIGSDK		// include interface of original SDK
#if RP2040		// 1=use MCU RP2040
#include "orig_rp2040/orig_uart.h"	// constants of original SDK
#else
#include "orig_rp2350/orig_uart.h"	// constants of original SDK
#endif
#include "sdk_timer.h"
#include "sdk_gpio.h"
#endif // USE_ORIGSDK

#ifdef __cplusplus
extern "C" {
#endif

#define PICO_DEFAULT_UART		UART_STDIO_PORT
#define PICO_DEFAULT_UART_TX_PIN	UART_STDIO_TX
#define PICO_DEFAULT_UART_RX_PIN	UART_STDIO_RX
#define PICO_DEFAULT_UART_BAUD_RATE	115200

// UART hardware registers
#define UART_BASE(uart) (UART0_BASE+(uart)*(UART1_BASE - UART0_BASE))	// UART base address (uart = 0 or 1)
#define UART_DR(uart)	((volatile u32*)(UART_BASE(uart)+0))	// data register (uart = 0 or 1)
#define UART_RSR(uart)	((volatile u32*)(UART_BASE(uart)+4))	// receive status register (uart = 0 or 1)
#define UART_FR(uart)	((volatile u32*)(UART_BASE(uart)+0x18))	// flag register (uart = 0 or 1)
#define UART_ILPR(uart)	((volatile u32*)(UART_BASE(uart)+0x20))	// IrDA Low-Power Divisor Register (uart = 0 or 1)
#define UART_IBRD(uart)	((volatile u32*)(UART_BASE(uart)+0x24))	// integer baud rate register (uart = 0 or 1)
#define UART_FBRD(uart)	((volatile u32*)(UART_BASE(uart)+0x28))	// fractional baud rate register (uart = 0 or 1)
#define UART_LCR(uart)	((volatile u32*)(UART_BASE(uart)+0x2C))	// line control register (uart = 0 or 1)
#define UART_CR(uart)	((volatile u32*)(UART_BASE(uart)+0x30))	// control register (uart = 0 or 1)
#define UART_IFLS(uart)	((volatile u32*)(UART_BASE(uart)+0x34))	// interrupt FIFO level select register (uart = 0 or 1)
#define UART_IMSC(uart)	((volatile u32*)(UART_BASE(uart)+0x38))	// interrupt mask register (uart = 0 or 1)
#define UART_RIS(uart)	((volatile u32*)(UART_BASE(uart)+0x3C))	// raw interrupt status register (uart = 0 or 1)
#define UART_MIS(uart)	((volatile u32*)(UART_BASE(uart)+0x40))	// masked interrupt status register (uart = 0 or 1)
#define UART_ICR(uart)	((volatile u32*)(UART_BASE(uart)+0x44))	// interrupt clear register (uart = 0 or 1)
#define UART_DMACR(uart) ((volatile u32*)(UART_BASE(uart)+0x48)) // DMA control register (uart = 0 or 1)

#define UART_DREQ(uart,rx) (DREQ_UART0_TX + (uart)*2 + (rx))

// UART hardware interface
typedef struct {
	io32	dr;		// 0x00: Data Register, UARTDR
	io32	rsr;		// 0x04: Receive Status Register/Error Clear Register, UARTRSR/UARTECR
	io32	_pad0[4];	// 0x08:
	io32	fr;		// 0x18: Flag Register, UARTFR
	io32	_pad1;		// 0x1C:
	io32	ilpr;		// 0x20: IrDA Low-Power Counter Register, UARTILPR
	io32	ibrd;		// 0x24: Integer Baud Rate Register, UARTIBRD
	io32	fbrd;		// 0x28: Fractional Baud Rate Register, UARTFBRD
	io32	lcr_h;		// 0x2C: Line Control Register, UARTLCR_H
	io32	cr;		// 0x30: Control Register, UARTCR
	io32	ifls;		// 0x34: Interrupt FIFO Level Select Register, UARTIFLS
	io32	imsc;		// 0x38: Interrupt Mask Set/Clear Register, UARTIMSC
	io32	ris;		// 0x3C: Raw Interrupt Status Register, UARTRIS
	io32	mis;		// 0x40: Masked Interrupt Status Register, UARTMIS
	io32	icr;		// 0x44: Interrupt Clear Register, UARTICR
	io32	dmacr;		// 0x48: DMA Control Register, UARTDMACR
} uart_hw_t;

#define uart0_hw ((uart_hw_t*)UART0_BASE)
#define uart1_hw ((uart_hw_t*)UART1_BASE)

STATIC_ASSERT(sizeof(uart_hw_t) == 0x4C, "Incorrect uart_hw_t!");

#define uart0	uart0_hw
#define uart1	uart1_hw

// parity (values are hardcoded in functions)
#define UART_PARITY_NONE	0	// no parity bit (PEN=0, EPS=0, SPS=0)
#define UART_PARITY_EVEN	1	// even parity (PEN=1, EPS=1, SPS=0)
#define UART_PARITY_ODD		2	// odd parity (PEN=1, EPS=0, SPS=0)
#define UART_PARITY_ZERO	3	// zero parity (PEN=1, EPS=1, SPS=1)
#define UART_PARITY_ONE		4	// one parity (PEN=1, EPS=0, SPS=1)

// FIFO trigger points (every FIFO is 32 entries deep)
#define UART_LEVEL_VERYLOW	0	// 1/8 (4 + 28 entries)
#define UART_LEVEL_LOW		1	// 1/4 (2/8) (8 + 24 entries)
#define UART_LEVEL_MID		2	// 1/2 (4/8) (16 + 16 entries) ... default
#define UART_LEVEL_HIGH		3	// 3/4 (6/8) (24 + 8 entries)
#define UART_LEVEL_VERYHIGH	4	// 7/8 (28 + 4 entries)

// UART interrupt
