
// ****************************************************************************
//
//                                GPIO pins
//
// ****************************************************************************
// PicoLibSDK - Alternative SDK library for Raspberry Pico and RP2040
// Copyright (c) 2023 Miroslav Nemecek, Panda38@seznam.cz, hardyplotter2@gmail.com
// 	https://github.com/Panda381/PicoLibSDK
//	https://www.breatharian.eu/hw/picolibsdk/index_en.html
//	https://github.com/pajenicko/picopad
//	https://picopad.eu/en/
// License:
//	This source code is freely available for any purpose, including commercial.
//	It is possible to take and modify the code or parts of it, without restriction.

// QFN-60 (RP2040, RP2350A): 30 GPIO pins, index 0..29
// QFN-80 (RP2350B): 48 GPIO pins, index 0..47

/* GPIO functions, RP2040
 * ======================
 * | GPIO   | F1       | F2        | F3       | F4     | F5  | F6   | F7   | F8            | F9            |
 * |--------|----------|-----------|----------|--------|-----|------|------|---------------|---------------|
 * | 0      | SPI0 RX  | UART0 TX  | I2C0 SDA | PWM0 A | SIO | PIO0 | PIO1 |               | USB OVCUR DET |
 * | 1      | SPI0 CSn | UART0 RX  | I2C0 SCL | PWM0 B | SIO | PIO0 | PIO1 |               | USB VBUS DET  |
 * | 2      | SPI0 SCK | UART0 CTS | I2C1 SDA | PWM1 A | SIO | PIO0 | PIO1 |               | USB VBUS EN   |

 * | 43   |    | SPI1 TX  | UART1 RTS | I2C1 SCL | PWM9 B  | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS DET  | UART1 RX |
 * | 44   |    | SPI1 RX  | UART0 TX  | I2C0 SDA | PWM10 A | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS EN   |          |
 * | 45   |    | SPI1 CSn | UART0 RX  | I2C0 SCL | PWM10 B | SIO | PIO0 | PIO1 | PIO2 |          | USB OVCUR DET |          |
 * | 46   |    | SPI1 SCK | UART0 CTS | I2C1 SDA | PWM11 A | SIO | PIO0 | PIO1 | PIO2 |          | USB VBUS DET  | UART0 TX |
 * | 47   |    | SPI1 TX  | UART0 RTS | I2C1 SCL | PWM11 B | SIO | PIO0 | PIO1 | PIO2 | XIP_CS1n | USB VBUS EN   | UART0 RX |
*/

#ifndef _SDK_GPIO_H
#define _SDK_GPIO_H

#include "../sdk_addressmap.h"		// Register address offsets
#include "sdk_cpu.h"
#include "sdk_irq.h"
#include "sdk_sio.h"
#include "sdk_gpio_coproc.h"		// GPIO coprocessor

#if USE_ORIGSDK		// include interface of original SDK
#if RP2040		// 1=use MCU RP2040
#include "orig_rp2040/orig_io_bank0.h"		// constants of original SDK
#include "orig_rp2040/orig_pads_bank0.h"	// constants of original SDK
#else
#include "orig_rp2350/orig_io_bank0.h"		// constants of original SDK
#include "orig_rp2350/orig_pads_bank0.h"	// constants of original SDK
#endif
#endif // USE_ORIGSDK

#ifdef __cplusplus
extern "C" {
#endif

// number of pins
#if RP2040

#define GPIO_PIN_NUM		30	// number of GPIO pin registers
#define GPIO_INT_REGNUM		4	// number of GPIO interrupt registers
#define GPIO_PIN_SWCLK		30	// SWCLK pin (only pad functions)
#define GPIO_PIN_SWD		31	// SWD pin (only pad functions)
typedef u32 gpio_mask_t;		// 32-bit pin mask
INLINE u32 PinRangeMask(int first, int last) { return RangeMask(first, last); } // mask of range of pins

#else // RP2350

#define GPIO_PIN_NUM		48	// number of GPIO pin registers
#define GPIO_INT_REGNUM		6	// number of GPIO interrupt registers
#define GPIO_PIN_SWCLK		48	// SWCLK pin (only pad functions)
#define GPIO_PIN_SWD		49	// SWD pin (only pad functions)
#define GPIO_PIN_USB_DP		56	// USB D+ pin (only pin data functions)
#define GPIO_PIN_USB_DM		57	// USB D- pin (only pin data functions)
#define GPIO_PIN_QSPI_SCK	58	// QSPI SCK pin (only pin data functions)
#define GPIO_PIN_QSPI_CSN	59	// QSPI CSn pin (only pin data functions)
#define GPIO_PIN_QSPI_SD0	60	// QSPI SD0 MOSI pin (only pin data functions)
#define GPIO_PIN_QSPI_SD1	61	// QSPI SD1 MISO pin (only pin data functions)
#define GPIO_PIN_QSPI_SD2	62	// QSPI SD2 pin (only pin data functions)
#define GPIO_PIN_QSPI_SD3	63	// QSPI SD3 pin (only pin data functions)
typedef u64 gpio_mask_t;		// 64-bit pin mask
INLINE u64 PinRangeMask(int first, int last) { return RangeMask64(first, last); } // mask of range of pins

#endif

// === GPIO pad control (pin = 0..31/RP2040 or 0..49/RP2350, including SWCLK and SWD)

// pad control hardware registers
#define GPIO_VOLT	((volatile u32*)(PADS_BANK0_BASE+0))	// voltage select
#define GPIO_PAD(pin) ((volatile u32*)(PADS_BANK0_BASE+(pin)*4+4)) // GPIO pad control register, pin = 0..31 or 0..49 (including SWCLK and SWD)

// pad control hardware interface
typedef struct {
	io32	voltage_select;		// 0x00: voltage select
	io32	io[GPIO_PIN_NUM];	// 0x04: pad control register
	io32	swclk;			// 0x7C: SWCLK pin pad control
	io32	swd;			// 0x80: SWD pin pad control
} pads_bank0_hw_t;

#if RP2040
STATIC_ASSERT(sizeof(pads_bank0_hw_t) == 0x84, "Incorrect pads_bank0_hw_t!");
#else
STATIC_ASSERT(sizeof(pads_bank0_hw_t) == 0xcc, "Incorrect pads_bank0_hw_t!");
#endif

#define pads_bank0_hw ((pads_bank0_hw_t*)PADS_BANK0_BASE)
#define padsbank0_hw_t pads_bank0_hw_t
#define padsbank0_hw pads_bank0_hw

// === GPIO pin control (pin = 0..29/RP2040 or 0..47/RP2350)

// pin control hardware registers
#define GPIO_STATUS(pin) ((volatile u32*)(IO_BANK0_BASE+(pin)*8)) // GPIO status (read only), pin = 0..29 or 0..47
#define GPIO_CTRL(pin) ((volatile u32*)(IO_BANK0_BASE+(pin)*8+4)) // GPIO pin control, pin = 0..29 or 0..47

// pin control hardware interface
typedef struct {
	io32	status;		// 0x00: GPIO status
	io32	ctrl;		// 0x04: GPIO control including function select and overrides
} io_bank0_status_ctrl_hw_t;

STATIC_ASSERT(sizeof(io_bank0_status_ctrl_hw_t) == 0x08, "Incorrect io_bank0_status_ctrl_hw_t!");

#define iobank0_status_ctrl_hw_t io_bank0_status_ctrl_hw_t

// === GPIO interrupt control (pin = 0..29/RP2040 or 0..47/RP2350)

// pin interrupt hardware registers
// IRQ control registers, array of 4*u32 (cpu = processor core 0 or 1; or 2 = dormant wake)
//  Interrupts EDGE are latched in INTR registers and must be cleared.
//  Interrupts LEVEL are not latched, they become inactive on end condition.
#if RP2040
#define GPIO_IRQ_INTR ((volatile u32*)(IO_BANK0_BASE+0xf0)) // raw interrupt of both CPUs
#define GPIO_IRQ_INTE(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x30+0x100)) // interrupt enable
#define GPIO_IRQ_INTF(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x30+0x100+0x10)) // force interrupt
#define GPIO_IRQ_INTS(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x30+0x100+0x20)) // interrupt status
#else
#define GPIO_IRQ_INTR ((volatile u32*)(IO_BANK0_BASE+0x230)) // raw interrupt of both CPUs
#define GPIO_IRQ_INTE(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x48+0x248)) // interrupt enable
#define GPIO_IRQ_INTF(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x48+0x248+0x18)) // force interrupt
#define GPIO_IRQ_INTS(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x48+0x248+0x30)) // interrupt status
#endif

// pin interrupt hardware interface
typedef struct {
	io32	inte[GPIO_INT_REGNUM];	// 0x00: Interrupt Enable
	io32	intf[GPIO_INT_REGNUM];	// 0x10 (0x18): Interrupt Force
	io32	ints[GPIO_INT_REGNUM];	// 0x20 (0x30): Interrupt status after masking & forcing
} io_bank0_irq_ctrl_hw_t;

#if RP2040
STATIC_ASSERT(sizeof(io_bank0_irq_ctrl_hw_t) == 0x30, "Incorrect io_bank0_irq_ctrl_hw_t!");
#else
STATIC_ASSERT(sizeof(io_bank0_irq_ctrl_hw_t) == 0x48, "Incorrect io_bank0_irq_ctrl_hw_t!");
#endif

// pin bank interface
typedef struct {
	io_bank0_status_ctrl_hw_t	io[GPIO_PIN_NUM];	// 0x000: pin control
#if !RP2040
	io32				_pad0[32];				// 0x180
	io32				irqsummary_proc0_secure[2];		// 0x200
	io32				irqsummary_proc0_nonsecure[2];		// 0x208
	io32				irqsummary_proc1_secure[2];		// 0x210
	io32				irqsummary_proc1_nonsecure[2];		// 0x218
	io32				irqsummary_dormant_wake_secure[2];	// 0x220
	io32				irqsummary_dormant_wake_nonsecure[2];	// 0x228
#endif
	io32				intr[GPIO_INT_REGNUM];		// 0x0F0 (0x230): Raw Interrupts
	union {
		struct {
			io_bank0_irq_ctrl_hw_t	proc0_irq_ctrl;		// 0x100 (0x248): interrupt control for proc0
			io_bank0_irq_ctrl_hw_t	proc1_irq_ctrl;		// 0x130 (0x290): interrupt control for proc1
			io_bank0_irq_ctrl_hw_t	dormant_wake_irq_ctrl;	// 0x160 (0x2D8): dormant interrupt control
		};
		io_bank0_irq_ctrl_hw_t	irq_ctrl[3];			// 0x100 (0x248):
	};
} io_bank0_hw_t;

#if RP2040
STATIC_ASSERT(sizeof(io_bank0_hw_t) == 0x190, "Incorrect io_bank0_hw_t!");
#else
STATIC_ASSERT(sizeof(io_bank0_hw_t) == 0x320, "Incorrect io_bank0_hw_t!");
#endif

#define io_bank0_hw ((io_bank0_hw_t*)IO_BANK0_BASE)
#define iobank0_hw io_bank0_hw

// === GPIO pin data (pin = 0..29/RP2040 or 0..47,56..63/RP2350 including USB and QSPI)

// GPIO pin data registers (bit 0..29 = pin 0..29)
//  (SIO does not support aliases for atomic access!)

#if RP2040
#define GPIO_IN_DATA		((volatile u32*)(SIO_BASE+4))		// GPIO input
#define GPIO_OUT_DATA		((volatile u32*)(SIO_BASE+0x10))	// GPIO output (read: last value written to output)
#define GPIO_OUT_SET		((volatile u32*)(SIO_BASE+0x14))	// GPIO output set
#define GPIO_OUT_CLR		((volatile u32*)(SIO_BASE+0x18))	// GPIO output clear
#define GPIO_OUT_XOR		((volatile u32*)(SIO_BASE+0x1C))	// GPIO output XOR
