
// ****************************************************************************
//
//                                      DMA
//                             Direct Memory Access
//
// ****************************************************************************
// PicoLibSDK - Alternative SDK library for Raspberry Pico and RP2040
// Copyright (c) 2023 Miroslav Nemecek, Panda38@seznam.cz, hardyplotter2@gmail.com
// 	https://github.com/Panda381/PicoLibSDK
//	https://www.breatharian.eu/hw/picolibsdk/index_en.html
//	https://github.com/pajenicko/picopad
//	https://picopad.eu/en/
// License:
//	This source code is freely available for any purpose, including commercial.
//	It is possible to take and modify the code or parts of it, without restriction.

#if USE_DMA	// use DMA controller (sdk_dma.c, sdk_dma.h)

#ifndef _SDK_DMA_H
#define _SDK_DMA_H

//#include "resource.h"		// Resources
#include "../sdk_addressmap.h"		// Register address offsets
#include "../sdk_dreq.h"
#include "sdk_cpu.h"

#if USE_ORIGSDK		// include interface of original SDK
#if RP2040		// 1=use MCU RP2040
#include "orig_rp2040/orig_dma.h"		// constants of original SDK
#else
#include "orig_rp2350/orig_dma.h"		// constants of original SDK
#endif
#endif // USE_ORIGSDK

#ifdef __cplusplus
extern "C" {
#endif

#if RP2040
#define DMA_CHANNELS 		12		// number of DMA channels
#define DMA_IRQ_NUM		2		// number of IRQs
#else
#define DMA_CHANNELS 		16		// number of DMA channels
#define DMA_IRQ_NUM		4		// number of IRQs
#endif

#define DMA_TIMERS		4		// number of DMA timers

// Trigger: write nonzero value to reload counter and start transfer
// Read address - auto shifted during transfer, can be read to get next address
// Write address - auto shifted during transfer, can be read to get next address
// Transfer count - can be read to get number of remaining transfers; auto reloaded from last set value on the trigger

// DMA channel hardware registers
// DMA channel register index - alias 0
#define DMA_CH_READ		0	// DMA channel read address
#define DMA_CH_WRITE		1	// DMA channel write address
#define DMA_CH_COUNT		2	// DMA channel transfer count (auto reloaded on trigger)
#define DMA_CH_CTRL_TRIG	3	// DMA channel control and status + trigger

// DMA channel register index - alias 1
#define DMA_CH_AL1_CTRL		4	// DMA channel control and status
#define DMA_CH_AL1_READ		5	// DMA channel read address
#define DMA_CH_AL1_WRITE	6	// DMA channel write address
#define DMA_CH_AL1_COUNT_TRIG	7	// DMA channel transfer count + trigger (auto reloaded on trigger)

// DMA channel register index - alias 2
#define DMA_CH_AL2_CTRL		8	// DMA channel control and status
#define DMA_CH_AL2_COUNT	9	// DMA channel transfer count (auto reloaded on trigger)
#define DMA_CH_AL2_READ		10	// DMA channel read address
#define DMA_CH_AL2_WRITE_TRIG	11	// DMA channel write address + trigger

// DMA channel register index - alias 3
#define DMA_CH_AL3_CTRL		12	// DMA channel control and status
#define DMA_CH_AL3_WRITE	13	// DMA channel write address
#define DMA_CH_AL3_COUNT	14	// DMA channel transfer count (auto reloaded on trigger)
#define DMA_CH_AL3_READ_TRIG	15	// DMA channel read address + trigger

// DMA channel hardware interface
typedef struct {
	// alias 0
	io32	read_addr;		// 0x00: Read Address pointer
	io32	write_addr;		// 0x04: Write Address pointer
	io32	transfer_count;		// 0x08: Transfer Count
	io32	ctrl_trig;		// 0x0C: Control and Status
	// alias 1
	io32	al1_ctrl;		// 0x10: Alias 1 CTRL register
	io32	al1_read_addr;		// 0x14: Alias 1 READ_ADDR register
	io32	al1_write_addr;		// 0x18: Alias 1 WRITE_ADDR register
	io32	al1_transfer_count_trig; // 0x1C: Alias 1 TRANS_COUNT register
	// alias 2
	io32	al2_ctrl;		// 0x20: Alias 2 CTRL register
	io32	al2_transfer_count;	// 0x24: Alias 2 TRANS_COUNT register
	io32	al2_read_addr;		// 0x28: Alias 2 READ_ADDR register
	io32	al2_write_addr_trig;	// 0x2C: Alias 2 WRITE_ADDR register
	// alias 3
	io32	al3_ctrl;		// 0x30: Alias 3 CTRL register
	io32	al3_write_addr;		// 0x34: Alias 3 WRITE_ADDR register
	io32	al3_transfer_count;	// 0x38: Alias 3 TRANS_COUNT register
	io32	al3_read_addr_trig;	// 0x3C: Alias 3 READ_ADDR register
} dma_channel_hw_t;

STATIC_ASSERT(sizeof(dma_channel_hw_t) == 0x40, "Incorrect dma_channel_hw_t!");

// DMA hardware registers
#define DMA_CHAN(chan)	((volatile u32*)(DMA_BASE+(chan)*0x40)) // DMA channel base address (chan = 0..11 or 0..15)

#define DMA_READ(chan)		(DMA_CHAN(chan)+DMA_CH_READ)	// DMA channel read register
#define DMA_READ_TRIG(chan)	(DMA_CHAN(chan)+DMA_CH_AL3_READ_TRIG) // DMA channel read register + trigger
#define DMA_WRITE(chan)		(DMA_CHAN(chan)+DMA_CH_WRITE)	// DMA channel write register
#define DMA_WRITE_TRIG(chan)	(DMA_CHAN(chan)+DMA_CH_AL2_WRITE_TRIG) // DMA channel write register + trigger
#define DMA_COUNT(chan)		(DMA_CHAN(chan)+DMA_CH_COUNT)	// DMA channel count register
#define DMA_COUNT_TRIG(chan)	(DMA_CHAN(chan)+DMA_CH_AL1_COUNT_TRIG) // DMA channel count register + trigger
#define DMA_CTRL(chan)		(DMA_CHAN(chan)+DMA_CH_AL1_CTRL)	// DMA channel control register
#define DMA_CTRL_TRIG(chan)	(DMA_CHAN(chan)+DMA_CH_CTRL_TRIG) // DMA channel control register + trigger

#define DMA_INTR	((volatile u32*)(DMA_BASE+0x400))	// raw interrupt status (write 1 to bit 0..15 to clear interrupt request)
#define DMA_INTE0	((volatile u32*)(DMA_BASE+0x404))	// interrupt enables for IRQ 0 (1 on bit 0..15 = pass interrupt to IRQ_DMA_0)
#define DMA_INTF0	((volatile u32*)(DMA_BASE+0x408))	// force interrupts for IRQ 0 (1 on bit 0..15 = force interrupt to IRQ_DMA_0, must be cleared)
#define DMA_INTS0	((volatile u32*)(DMA_BASE+0x40c))	// interrupt status for IRQ 0 (1 on bit 0..15 if request is pending on IRQ_DMA_0, write 1 to clear)
#define DMA_INTE1	((volatile u32*)(DMA_BASE+0x414))	// interrupt enables for IRQ 1 (1 on bit 0..15 = pass interrupt to IRQ_DMA_1)
#define DMA_INTF1	((volatile u32*)(DMA_BASE+0x418))	// force interrupts for IRQ 1 (1 on bit 0..15 = force interrupt to IRQ_DMA_1, must be cleared)
#define DMA_INTS1	((volatile u32*)(DMA_BASE+0x41c))	// interrupt status for IRQ 1 (1 on bit 0..15 if request is pending on IRQ_DMA_1, write 1 to clear)

#if RP2040

#define DMA_TIMER(inx)	((volatile u32*)(DMA_BASE+0x420+(inx)*4)) // base address of fractional timer 0..3, trigger on rate X/Y*sys_clk, bit 0..15=Y, bit 16..31=X, 0=off
#define DMA_MULTRIG	((volatile u32*)(DMA_BASE+0x430))	// multiply trigger, bits 0..15
#define DMA_SNIFF_CTRL	((volatile u32*)(DMA_BASE+0x434))	// sniffer control
#define DMA_SNIFF_DATA	((volatile u32*)(DMA_BASE+0x438))	// sniffer data (write initial seed value, read result)
#define DMA_FIFO_LEVELS	((volatile u32*)(DMA_BASE+0x440))	// debug levels (bit 0..7 = transfer data FIFO, bit 8..15 = write address FIFO, bit 16..23 = read address FIFO)
#define DMA_ABORT	((volatile u32*)(DMA_BASE+0x444))	// abort transfer (write 1 to bit 0..15 to abort transfer, read to wait until abort completed)

#else // RP2040

#define DMA_INTE2	((volatile u32*)(DMA_BASE+0x424))	// interrupt enables for IRQ 2 (1 on bit 0..15 = pass interrupt to IRQ_DMA_2)
#define DMA_INTF2	((volatile u32*)(DMA_BASE+0x428))	// force interrupts for IRQ 2 (1 on bit 0..15 = force interrupt to IRQ_DMA_2, must be cleared)
#define DMA_INTS2	((volatile u32*)(DMA_BASE+0x42c))	// interrupt status for IRQ 2 (1 on bit 0..15 if request is pending on IRQ_DMA_2, write 1 to clear)
#define DMA_INTE3	((volatile u32*)(DMA_BASE+0x434))	// interrupt enables for IRQ 3 (1 on bit 0..15 = pass interrupt to IRQ_DMA_3)
#define DMA_INTF3	((volatile u32*)(DMA_BASE+0x438))	// force interrupts for IRQ 3 (1 on bit 0..15 = force interrupt to IRQ_DMA_3, must be cleared)
#define DMA_INTS3	((volatile u32*)(DMA_BASE+0x43c))	// interrupt status for IRQ 3 (1 on bit 0..15 if request is pending on IRQ_DMA_3, write 1 to clear)

#define DMA_TIMER(inx)	((volatile u32*)(DMA_BASE+0x440+(inx)*4)) // base address of fractional timer 0..3, trigger on rate X/Y*sys_clk, bit 0..15=Y, bit 16..31=X, 0=off
#define DMA_MULTRIG	((volatile u32*)(DMA_BASE+0x450))	// multiply trigger, bits 0..15
#define DMA_SNIFF_CTRL	((volatile u32*)(DMA_BASE+0x454))	// sniffer control
#define DMA_SNIFF_DATA	((volatile u32*)(DMA_BASE+0x458))	// sniffer data (write initial seed value, read result)
#define DMA_FIFO_LEVELS	((volatile u32*)(DMA_BASE+0x460))	// debug levels (bit 0..7 = transfer data FIFO, bit 8..15 = write address FIFO, bit 16..23 = read address FIFO)
#define DMA_ABORT	((volatile u32*)(DMA_BASE+0x464))	// abort transfer (write 1 to bit 0..15 to abort transfer, read to wait until abort completed)

#endif // RP2040

#define DMA_NEXT(chan)	((volatile u32*)(DMA_BASE+0x804+(chan)*0x40)) // next transfer count of channel 0..11 (auto loaded into count register on trigger)

#if !RP2040
// DMA MPU region
typedef struct {
	io32	bar;		// 0x00: base address
	io32	lar;		// 0x04: limit address
} dma_mpu_region_hw_t;

STATIC_ASSERT(sizeof(dma_mpu_region_hw_t) == 0x08, "Incorrect dma_mpu_region_hw_t!");
#endif

// DMA IRQ interupt
typedef struct {
	io32	intr;			// 0x00: Raw Interrupt Status
	io32	inte;			// 0x04: Interrupt Enable
	io32	intf;			// 0x08: Force Interrupt
	io32	ints;			// 0x0C: Interrupt Status
} dma_irq_ctrl_hw_t;

STATIC_ASSERT(sizeof(dma_irq_ctrl_hw_t) == 0x10, "Incorrect dma_irq_ctrl_hw_t!");

// DMA hardware interface
typedef struct {
	dma_channel_hw_t ch[DMA_CHANNELS]; // 0x000: DMA channels
#if RP2040
	io32	_pad0[64];		// 0x300:
	union {
		struct {
			io32	intr;			// 0x400: Raw Interrupt Status
			io32	inte0;			// 0x404: Interrupt Enables for IRQ 0
			io32	intf0;			// 0x408: Force Interrupts for IRQ 0
			io32	ints0;			// 0x40C: Interrupt Status for IRQ 0

			io32	__pad0;			// 0x410:
			io32	inte1;			// 0x414: Interrupt Enables for IRQ 1
			io32	intf1;			// 0x418: Force Interrupts for IRQ 1
			io32	ints1;			// 0x41C: Interrupt Status for IRQ 1
		};
		dma_irq_ctrl_hw_t	irq_ctrl[2];	// 0x400:
	};
#else // RP2040
	union {
		struct {
			io32	intr;			// 0x400: Raw Interrupt Status
			io32	inte0;			// 0x404: Interrupt Enables for IRQ 0
			io32	intf0;			// 0x408: Force Interrupts for IRQ 0
			io32	ints0;			// 0x40C: Interrupt Status for IRQ 0

			io32	__pad0;			// 0x410:
			io32	inte1;			// 0x414: Interrupt Enables for IRQ 1
			io32	intf1;			// 0x418: Force Interrupts for IRQ 1
			io32	ints1;			// 0x41C: Interrupt Status for IRQ 1

			io32	__pad1;			// 0x420:
			io32	inte2;			// 0x424: Interrupt Enables for IRQ 2
			io32	intf2;			// 0x428: Force Interrupts for IRQ 2
			io32	ints2;			// 0x42C: Interrupt Status for IRQ 2

			io32	__pad2;			// 0x430:
			io32	inte3;			// 0x434: Interrupt Enables for IRQ 3
			io32	intf3;			// 0x438: Force Interrupts for IRQ 3
			io32	ints3;			// 0x43C: Interrupt Status for IRQ 3
		};
		dma_irq_ctrl_hw_t	irq_ctrl[4];	// 0x400:
	};
#endif // RP2040

	io32	timer[DMA_TIMERS];	// 0x420 (0x440): 4x Pacing (X/Y) Fractional Timer
	io32	multi_channel_trigger;	// 0x430 (0x450): Trigger one or more channels simultaneously
	io32	sniff_ctrl;		// 0x434 (0x454): Sniffer Control
	io32	sniff_data;		// 0x438 (0x458): Data accumulator for sniff hardware
	io32	_pad1;			// 0x43C (0x45C):
	io32	fifo_levels;		// 0x440 (0x460): Debug RAF, WAF, TDF levels
	io32	abort;			// 0x444 (0x464): Abort an in-progress transfer sequence on one or more channels
#if !RP2040
	io32	n_channels;		// 0x468: R/O Number of DMA channels (12 or 16)
	io32	_pad2[5];		// 0x46C:
	io32	seccfg_h[DMA_CHANNELS];	// 0x480: Security level configuration for channels
	io32	seccfg_irq[4];		// 0x4C0: Security configuration for IRQs
	io32	seccfg_misc;		// 0x4D0: Miscellaneous security configuration
	io32	_pad3[11];		// 0x4D4:
	io32	mpu_ctrl;		// 0x500:
	dma_mpu_region_hw_t mpu_region[8]; // 0x504: Control register for DMA MPU
#endif
} dma_hw_t;

#if RP2040
STATIC_ASSERT(sizeof(dma_hw_t) == 0x448, "Incorrect dma_hw_t!");
#else
STATIC_ASSERT(sizeof(dma_hw_t) == 0x544, "Incorrect dma_hw_t!");
#endif

#define dma_hw ((dma_hw_t*)DMA_BASE)

// DMA debug interface
typedef struct {
	io32	ctrdeq;		// 0x00: get channel DREQ counter
	io32	tcr;		// 0x04: get channel TRANS_COUNT reload value
	io32	pad[14];
} dma_debug_channel_hw_t;

STATIC_ASSERT(sizeof(dma_debug_channel_hw_t) == 0x40, "Incorrect dma_debug_channel_hw_t!");

typedef struct {
	dma_debug_channel_hw_t ch[DMA_CHANNELS];
} dma_debug_hw_t;

#if RP2040
STATIC_ASSERT(sizeof(dma_debug_hw_t) == 0x300, "Incorrect dma_debug_hw_t!");
#else
STATIC_ASSERT(sizeof(dma_debug_hw_t) == 0x400, "Incorrect dma_debug_hw_t!");
#endif

#define dma_debug_hw ((dma_debug_hw_t*)(DMA_BASE + 0x800))

// DMA transfer size
#define DMA_SIZE_8	0	// 1 byte (8 bits)
#define DMA_SIZE_16	1	// 2 bytes (16 bits)
#define DMA_SIZE_32	2	// 4 bytes (32 bits)

// flags of DMA control and status register CTRL
#define DMA_CTRL_ERROR		B31	// 1 = read or write error, channel halts on error and raises IRQ (read only)
#define DMA_CTRL_READ_ERROR	B30	// 1 = read error (write 1 to clear)
#define DMA_CTRL_WRITE_ERROR	B29	// 1 = write error (write 1 to clear)

#if RP2040

#define DMA_CTRL_TREQ_LSB	15
