
// ****************************************************************************
//
//                                  PIO
//                    Programmable Input/Output Block
//
// ****************************************************************************
// PicoLibSDK - Alternative SDK library for Raspberry Pico and RP2040
// Copyright (c) 2023 Miroslav Nemecek, Panda38@seznam.cz, hardyplotter2@gmail.com
// 	https://github.com/Panda381/PicoLibSDK
//	https://www.breatharian.eu/hw/picolibsdk/index_en.html
//	https://github.com/pajenicko/picopad
//	https://picopad.eu/en/
// License:
//	This source code is freely available for any purpose, including commercial.
//	It is possible to take and modify the code or parts of it, without restriction.

/* How to use PIO:
- initialize PIO and all SMs with PioInit
- load program with PioLoadProg
- set wrap address with PioSetWrap
- set start address with PioSetAddr if not 0
- setup GPIO pins to use PIO with PioSetupGPIO
- setup state machine parameters with PioSet*
- set pin state and direction with PioSetPin and PioSetPinDir
- setup DMA if needed
- setup IRQ if needed (PioIrqEnable)
- start SM with PioSMEnableMask
- transfer data with PioWriteWait and PioReadWait
*/

#if USE_PIO	// use PIO (sdk_pio.c, sdk_pio.h)

#ifndef _SDK_PIO_H
#define _SDK_PIO_H

#include "../sdk_addressmap.h"		// Register address offsets
#include "../sdk_dreq.h"
#include "sdk_cpu.h"
#include "sdk_gpio.h"

#if USE_ORIGSDK		// include interface of original SDK

#include "orig_rp2350/orig_pio.h"		// constants of original SDK
#endif
#endif // USE_ORIGSDK

#ifdef __cplusplus
extern "C" {
#endif

#if RP2040
#define PIO_NUM			2		// number of PIO controllers
#else
#define PIO_NUM			3		// number of PIO controllers
#endif

#define PIO_SM_NUM		4		// number of PIO state machines
#define PIO_MEM_NUM		32		// number of PIO instructions in memory
#define PIO_IRQ_NUM		2		// number of PIO interrupt requests
#define PIO_FIFO_NUM		4		// number of PIO single FIFO entries
#define PIO_FIFO2_NUM		8		// number of PIO double FIFO entries

//#define NUM_PIO_STATE_MACHINES	PIO_SM_NUM
//#define PIO_INSTRUCTION_COUNT	PIO_MEM_NUM

// PIO hardware registers
#define PIO(pio)		(PIO0_BASE + (pio)*(PIO1_BASE - PIO0_BASE)) // PIO base (pio = 0..2)

#define PIO_CTRL(pio)		((volatile u32*)(PIO(pio)+0x00)) // control register
#define PIO_FSTAT(pio)		((volatile u32*)(PIO(pio)+0x04)) // FIFO status register
#define PIO_FDEBUG(pio)		((volatile u32*)(PIO(pio)+0x08)) // FIFO debug register
#define PIO_FLEVEL(pio)		((volatile u32*)(PIO(pio)+0x0C)) // FIFO level register
#define PIO_TXF(pio, sm)	((volatile u32*)(PIO(pio)+0x10+(sm)*4)) // TX FIFO for this state machine (sm = 0 to 3)
#define PIO_RXF(pio, sm)	((volatile u32*)(PIO(pio)+0x20+(sm)*4)) // RX FIFO for this state machine (sm = 0 to 3)
#define PIO_IRQ(pio)		((volatile u32*)(PIO(pio)+0x30)) // IRQ register
#define PIO_IRQFORCE(pio)	((volatile u32*)(PIO(pio)+0x34)) // IRQ force register
#define PIO_INPUTSYNC(pio)	((volatile u32*)(PIO(pio)+0x38)) // GPIO input synchronizer bypass
#define PIO_DBG_PADOUT(pio)	((volatile u32*)(PIO(pio)+0x3C)) // read pad output
#define PIO_DBG_PADOE(pio)	((volatile u32*)(PIO(pio)+0x40)) // read pad output enables
#define PIO_DBG_CFGINFO(pio)	((volatile u32*)(PIO(pio)+0x44)) // PIO config info
#define PIO_MEM(pio, off)	((volatile u32*)(PIO(pio)+0x48+(off)*4)) // instruction memory (off = 0 to 31)
#define PIO_CLKDIV(pio, sm)	((volatile u32*)(PIO(pio)+0xC8+(sm)*0x18)) // clock divider (sm = 0 to 3)
#define PIO_EXECCTRL(pio, sm)	((volatile u32*)(PIO(pio)+0xCC+(sm)*0x18)) // execution settings (sm = 0 to 3)
#define PIO_SHIFTCTRL(pio, sm)	((volatile u32*)(PIO(pio)+0xD0+(sm)*0x18)) // control shift registers (sm = 0 to 3)
#define PIO_ADDR(pio, sm)	((volatile u32*)(PIO(pio)+0xD4+(sm)*0x18)) // current instruction address (sm = 0 to 3)
#define PIO_INSTR(pio, sm)	((volatile u32*)(PIO(pio)+0xD8+(sm)*0x18)) // current executed instruction (sm = 0 to 3)
#define PIO_PINCTRL(pio, sm)	((volatile u32*)(PIO(pio)+0xDC+(sm)*0x18)) // pin control (sm = 0 to 3)
#define PIO_INTR(pio)		((volatile u32*)(PIO(pio)+0x128)) // raw interrupts
#define PIO_INTE(pio,irq)	((volatile u32*)(PIO(pio)+0x12C+(irq)*12)) // interrupt enable (irq = 0 or 1)
#define PIO_INTF(pio,irq)	((volatile u32*)(PIO(pio)+0x130+(irq)*12)) // interrupt force (irq = 0 or 1)
#define PIO_INTS(pio,irq)	((volatile u32*)(PIO(pio)+0x134+(irq)*12)) // interrupt status (irq = 0 or 1)

// State machine hardware interface
typedef struct pio_sm_hw {
	io32	clkdiv;		// 0x00: Clock divisor register
	io32	execctrl;	// 0x04: Execution/behavioural settings
	io32	shiftctrl;	// 0x08: Control behaviour of the input/output shift registers
	io32	addr;		// 0x0C: Current instruction address
	io32	instr;		// 0x10: Read to see the instruction currently addressed by state machine's program counter
	io32	pinctrl;	// 0x14: State machine pin control
} pio_sm_hw_t;

STATIC_ASSERT(sizeof(pio_sm_hw_t) == 0x18, "Incorrect pio_sm_hw_t!");

// PIO interrupt interface
typedef struct {
	io32	inte;		// 0x00: Interrupt Enable
	io32	intf;		// 0x04: Interrupt Force
	io32	ints;		// 0x08: Interrupt status after masking & forcing
} pio_irq_ctrl_hw_t;

STATIC_ASSERT(sizeof(pio_irq_ctrl_hw_t) == 0x0C, "Incorrect pio_irq_ctrl_hw_t!");

// PIO hardware interface
typedef struct {
	io32	ctrl;			// 0x000: PIO control register
	io32	fstat;			// 0x004: FIFO status register
	io32	fdebug;			// 0x008: FIFO debug register
	io32	flevel;			// 0x00C: FIFO levels
	io32	txf[PIO_SM_NUM];	// 0x010: (4) Direct write access to the TX FIFO for this state machine
	io32	rxf[PIO_SM_NUM];	// 0x020: (4) Direct read access to the RX FIFO for this state machine
	io32	irq;			// 0x030: State machine IRQ flags register
	io32	irq_force;		// 0x034: Writing a 1 to each of these bits will forcibly assert the corresponding IRQ
	io32	input_sync_bypass;	// 0x038: There is a 2-flipflop synchronizer on each GPIO input, which protects PIO logic from metastabilities
	io32	dbg_padout;		// 0x03C: Read to sample the pad output values PIO is currently driving to the GPIOs
	io32	dbg_padoe;		// 0x040: Read to sample the pad output enables (direction) PIO is currently driving to the GPIOs
	io32	dbg_cfginfo;		// 0x044: The PIO hardware has some free parameters that may vary between chip products
	io32	instr_mem[PIO_MEM_NUM];	// 0x048: (32, 0x80 bytes) Write-only access to instruction memory location 0
	pio_sm_hw_t sm[PIO_SM_NUM];	// 0x0C8: (0x18*4 = 0x60) state machines
#if !RP2040
	io32	rxf_putget[PIO_SM_NUM][PIO_FIFO_NUM]; // 0x128: (4*4*4 = 0x40) direct access to RX FIFO entry
	io32	gpiobase;		// 0x168: relocate GPIO base to access more than 32 GPIOs
#endif
	io32	intr;			// 0x128 (0x16C): Raw Interrupts
	union {
		struct {
			io32	inte0;	// 0x12C (0x170): Interrupt Enable for irq0
			io32	intf0;	// 0x130 (0x174): Interrupt Force for irq0
			io32	ints0;	// 0x134 (0x178): Interrupt status after masking & forcing for irq0

			io32	inte1;	// 0x138: (0x17C) Interrupt Enable for irq1
			io32	intf1;	// 0x13C: (0x180) Interrupt Force for irq1
			io32	ints1;	// 0x140: (0x184) Interrupt status after masking & forcing for irq1
		};
		pio_irq_ctrl_hw_t irq_ctrl[PIO_IRQ_NUM]; // 0x12C (0x170)
	};
} pio_hw_t;

#if RP2040
STATIC_ASSERT(sizeof(pio_hw_t) == 0x144, "Incorrect pio_hw_t!");
#else
STATIC_ASSERT(sizeof(pio_hw_t) == 0x188, "Incorrect pio_hw_t!");
#endif

#define pio0_hw ((pio_hw_t*)PIO0_BASE)
#define pio0 pio0_hw

#define pio1_hw ((pio_hw_t*)PIO1_BASE)
#define pio1 pio1_hw

#if !RP2040
#define pio2_hw ((pio_hw_t*)PIO2_BASE)
#define pio2 pio1_hw
#endif

// State machine configuration structure
typedef struct {
	u32	clkdiv;
	u32	execctrl;
	u32	shiftctrl;
	u32	pinctrl;
} pio_sm_config;

// instructions
#define PIO_NOP		0xA042	// NOP pseudoinstruction = MOV Y,Y  side 0

// PIO instruction base bits
#define PIO_INSTR_JMP	0x0000
#define PIO_INSTR_WAIT	0x2000
#define PIO_INSTR_IN	0x4000
#define PIO_INSTR_OUT	0x6000
#define PIO_INSTR_PUSH	0x8000		// bit 7 is also crucial
#define PIO_INSTR_PULL	0x8080		// bit 7 is also crucial
#define PIO_INSTR_MOV	0xA000
#define PIO_INSTR_IRQ	0xC000
#define PIO_INSTR_SET	0xE000

