
// ****************************************************************************
//
//                                GPIO pins
//
// ****************************************************************************
// PicoLibSDK - Alternative SDK library for Raspberry Pico and RP2040
// Copyright (c) 2023 Miroslav Nemecek, Panda38@seznam.cz, hardyplotter2@gmail.com
// 	https://github.com/Panda381/PicoLibSDK
//	https://www.breatharian.eu/hw/picolibsdk/index_en.html
//	https://github.com/pajenicko/picopad
//	https://picopad.eu/en/
// License:
//	This source code is freely available for any purpose, including commercial.
//	It is possible to take and modify the code or parts of it, without restriction.

// 30 GPIO pins: index 0..29

/* GPIO functions
 * ==============
 *
 *  GPIO   | F1       | F2        | F3       | F4     | F5  | F6   | F7   | F8            | F9
 *  -------|----------|-----------|----------|--------|-----|------|------|---------------|----
 *  0      | SPI0 RX  | UART0 TX  | I2C0 SDA | PWM0 A | SIO | PIO0 | PIO1 |               | USB OVCUR DET
 *  1      | SPI0 CSn | UART0 RX  | I2C0 SCL | PWM0 B | SIO | PIO0 | PIO1 |               | USB VBUS DET
 *  2      | SPI0 SCK | UART0 CTS | I2C1 SDA | PWM1 A | SIO | PIO0 | PIO1 |               | USB VBUS EN
 *  3      | SPI0 TX  | UART0 RTS | I2C1 SCL | PWM1 B | SIO | PIO0 | PIO1 |               | USB OVCUR DET
 *  4      | SPI0 RX  | UART1 TX  | I2C0 SDA | PWM2 A | SIO | PIO0 | PIO1 |               | USB VBUS DET

 *  11     | SPI1 TX  | UART1 RTS | I2C1 SCL | PWM5 B | SIO | PIO0 | PIO1 |               | USB VBUS EN
 *  12     | SPI1 RX  | UART0 TX  | I2C0 SDA | PWM6 A | SIO | PIO0 | PIO1 |               | USB OVCUR DET
 *  13     | SPI1 CSn | UART0 RX  | I2C0 SCL | PWM6 B | SIO | PIO0 | PIO1 |               | USB VBUS DET
 *  14     | SPI1 SCK | UART0 CTS | I2C1 SDA | PWM7 A | SIO | PIO0 | PIO1 |               | USB VBUS EN
 *  15     | SPI1 TX  | UART0 RTS | I2C1 SCL | PWM7 B | SIO | PIO0 | PIO1 |               | USB OVCUR DET
 *  16     | SPI0 RX  | UART0 TX  | I2C0 SDA | PWM0 A | SIO | PIO0 | PIO1 |               | USB VBUS DET
 *  17     | SPI0 CSn | UART0 RX  | I2C0 SCL | PWM0 B | SIO | PIO0 | PIO1 |               | USB VBUS EN
 *  18     | SPI0 SCK | UART0 CTS | I2C1 SDA | PWM1 A | SIO | PIO0 | PIO1 |               | USB OVCUR DET
 *  19     | SPI0 TX  | UART0 RTS | I2C1 SCL | PWM1 B | SIO | PIO0 | PIO1 |               | USB VBUS DET
 *  20     | SPI0 RX  | UART1 TX  | I2C0 SDA | PWM2 A | SIO | PIO0 | PIO1 | CLOCK GPIN0   | USB VBUS EN
 *  21     | SPI0 CSn | UART1 RX  | I2C0 SCL | PWM2 B | SIO | PIO0 | PIO1 | CLOCK GPOUT0  | USB OVCUR DET
 *  22     | SPI0 SCK | UART1 CTS | I2C1 SDA | PWM3 A | SIO | PIO0 | PIO1 | CLOCK GPIN1   | USB VBUS DET
 *  23     | SPI0 TX  | UART1 RTS | I2C1 SCL | PWM3 B | SIO | PIO0 | PIO1 | CLOCK GPOUT1  | USB VBUS EN
 *  24     | SPI1 RX  | UART1 TX  | I2C0 SDA | PWM4 A | SIO | PIO0 | PIO1 | CLOCK GPOUT2  | USB OVCUR DET
 *  25     | SPI1 CSn | UART1 RX  | I2C0 SCL | PWM4 B | SIO | PIO0 | PIO1 | CLOCK GPOUT3  | USB VBUS DET
 *  26     | SPI1 SCK | UART1 CTS | I2C1 SDA | PWM5 A | SIO | PIO0 | PIO1 |               | USB VBUS EN
 *  27     | SPI1 TX  | UART1 RTS | I2C1 SCL | PWM5 B | SIO | PIO0 | PIO1 |               | USB OVCUR DET
 *  28     | SPI1 RX  | UART0 TX  | I2C0 SDA | PWM6 A | SIO | PIO0 | PIO1 |               | USB VBUS DET
 *  29     | SPI1 CSn | UART0 RX  | I2C0 SCL | PWM6 B | SIO | PIO0 | PIO1 |               | USB VBUS EN
*/

#ifndef _SDK_GPIO_H
#define _SDK_GPIO_H

#include "../sdk_addressmap.h"		// Register address offsets
#include "sdk_cpu.h"
#include "sdk_irq.h"
#include "sdk_sio.h"

#if USE_ORIGSDK		// include interface of original SDK
#include "orig/orig_io_bank0.h"		// constants of original SDK
#include "orig/orig_pads_bank0.h"	// constants of original SDK
#endif // USE_ORIGSDK

#ifdef __cplusplus
extern "C" {
#endif

#define GPIO_PIN_NUM	30		// number of GPIO pins
#define GPIO_PIN_ALLMASK 0x3FFFFFFF	// mask of all GPIO pins
#define NUM_BANK0_GPIOS	GPIO_PIN_NUM	// original-SDK value

#define GPIO_PIN_SWCLK	30		// SWCLK pin
#define GPIO_PIN_SWD	31		// SWD pin

// === GPIO pad control (pin = 0..31, including SWCLK and SWD)

// pad control hardware registers
//#define PADS_BANK0_BASE		0x4001c000	// GPIO pad control
#define GPIO_VOLT	((volatile u32*)(PADS_BANK0_BASE+0))	// voltage select
#define GPIO_PAD(pin) ((volatile u32*)(PADS_BANK0_BASE+(pin)*4+4)) // GPIO pad control register, pin = 0..31 (including SWCLK and SWD)

// pad control hardware interface
typedef struct {
	io32	voltage_select;		// 0x00: voltage select
	io32	io[GPIO_PIN_NUM];	// 0x04: pad control register
	io32	swclk;			// 0x7C: SWCLK pin pad control
	io32	swd;			// 0x80: SWD pin pad control
} padsbank0_hw_t;

#define padsbank0_hw ((padsbank0_hw_t*)PADS_BANK0_BASE)

STATIC_ASSERT(sizeof(padsbank0_hw_t) == 0x84, "Incorrect padsbank0_hw_t!");

// === GPIO pin control

// pin control hardware registers
//#define IO_BANK0_BASE		0x40014000	// GPIO pads
#define GPIO_STATUS(pin) ((volatile u32*)(IO_BANK0_BASE+(pin)*8)) // GPIO status (read only), pin = 0..29
#define GPIO_CTRL(pin) ((volatile u32*)(IO_BANK0_BASE+(pin)*8+4)) // GPIO pin control, pin = 0..29

// pin control hardware interface
typedef struct {
	io32	status;		// 0x00: GPIO status
	io32	ctrl;		// 0x04: GPIO control including function select and overrides
} iobank0_status_ctrl_hw_t;

STATIC_ASSERT(sizeof(iobank0_status_ctrl_hw_t) == 0x08, "Incorrect iobank0_status_ctrl_hw_t!");

// === GPIO interrupt control

// pin interrupt hardware registers
// IRQ control registers, array of 4*u32 (cpu = processor core 0 or 1; or 2 = dormant wake)
//  Interrupts EDGE are latched in INTR registers and must be cleared.
//  Interrupts LEVEL are not latched, they become inactive on end condition.
#define GPIO_IRQ_INTR ((volatile u32*)(IO_BANK0_BASE+0xf0)) // raw interrupt of both CPUs
#define GPIO_IRQ_INTE(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x30+0x100)) // interrupt enable
#define GPIO_IRQ_INTF(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x30+0x110)) // force interrupt
#define GPIO_IRQ_INTS(cpu) ((volatile u32*)(IO_BANK0_BASE+(cpu)*0x30+0x120)) // interrupt status

// pin interrupt hardware interface
typedef struct {
	io32	inte[4];	// 0x00: Interrupt Enable
	io32	intf[4];	// 0x10: Interrupt Force
	io32	ints[4];	// 0x20: Interrupt status after masking & forcing
} io_irq_ctrl_hw_t;

STATIC_ASSERT(sizeof(io_irq_ctrl_hw_t) == 0x30, "Incorrect io_irq_ctrl_hw_t!");

// pin bank interface
typedef struct {
	iobank0_status_ctrl_hw_t	io[GPIO_PIN_NUM];	// 0x000: pin control
	io32				intr[4];		// 0x0F0: Raw Interrupts
	io_irq_ctrl_hw_t		proc0_irq_ctrl;		// 0x100: interrupt control for proc0
	io_irq_ctrl_hw_t		proc1_irq_ctrl;		// 0x130: interrupt control for proc1
	io_irq_ctrl_hw_t		dormant_wake_irq_ctrl;	// 0x160: dormant interrupt control
} iobank0_hw_t;

#define iobank0_hw ((iobank0_hw_t*)IO_BANK0_BASE)

STATIC_ASSERT(sizeof(iobank0_hw_t) == 0x190, "Incorrect iobank0_hw_t!");

// === GPIO pin data

// GPIO pin data registers (bit 0..29 = pin 0..29)
//#define SIO_BASE		0xd0000000	// SIO registers
//  (SIO does not support aliases for atomic access!)
#define GPIO_IN_DATA	((volatile u32*)(SIO_BASE+4))		// GPIO input
#define GPIO_OUT_DATA	((volatile u32*)(SIO_BASE+0x10))	// GPIO output (read: last value written to output)
#define GPIO_OUT_SET	((volatile u32*)(SIO_BASE+0x14))	// GPIO output set
#define GPIO_OUT_CLR	((volatile u32*)(SIO_BASE+0x18))	// GPIO output clear
#define GPIO_OUT_XOR	((volatile u32*)(SIO_BASE+0x1C))	// GPIO output XOR
#define GPIO_OE		((volatile u32*)(SIO_BASE+0x20))	// GPIO output enable (read: last value written)
#define GPIO_OE_SET	((volatile u32*)(SIO_BASE+0x24))	// GPIO output enable set
